; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v3 - type_3)
 	      (pred_2 ?v4 - object ?v3 - type_3)
	      (pred_1 ?v2 - type_1 ?v6 - type_2)
	      (pred_3 ?v2 - type_1 ?v4 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v2 - type_1 ?v8 ?v1 - type_3)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v1)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_1 ?v5 - object ?v7 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v7) (pred_4 ?v2 ?v7) (pred_1 ?v2 ?v6))
       :effect (and (pred_3 ?v2 ?v5 ?v6)
		    (not (pred_2 ?v5 ?v7)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_1 ?v5 - object ?v7 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v5 ?v6) (pred_4 ?v2 ?v7))
       :effect (and (pred_2 ?v5 ?v7)
		    (pred_1 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v5 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_03 - type_1
obj_09 obj_10 - type_2
obj_05 obj_06 obj_02 obj_07 - type_3
obj_04 obj_01 obj_08 - object)
(:init
(pred_4 obj_03 obj_06)
(pred_1 obj_03 obj_09)
(pred_1 obj_03 obj_10)
(pred_2 obj_04 obj_05)
(pred_2 obj_01 obj_07)
(pred_2 obj_08 obj_02)
)
(:goal
(and
(pred_2 obj_04 obj_07)
(pred_2 obj_01 obj_06)
(pred_2 obj_08 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_10))))
)
)

; plan
1. (op_1 obj_03 obj_06 obj_05)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_05)
   goals met: 0 of 3
2. (op_3 obj_03 obj_04 obj_05 obj_09)
   deleted: (pred_2 obj_04 obj_05) (pred_1 obj_03 obj_09)
   added: (pred_3 obj_03 obj_04 obj_09)
   goals met: 0 of 3
3. (op_1 obj_03 obj_05 obj_07)
   deleted: (pred_4 obj_03 obj_05)
   added: (pred_4 obj_03 obj_07)
   goals met: 0 of 3
4. (op_2 obj_03 obj_04 obj_07 obj_09)
   deleted: (pred_3 obj_03 obj_04 obj_09)
   added: (pred_2 obj_04 obj_07) (pred_1 obj_03 obj_09)
   goals met: 1 of 3
5. (op_3 obj_03 obj_01 obj_07 obj_09)
   deleted: (pred_2 obj_01 obj_07) (pred_1 obj_03 obj_09)
   added: (pred_3 obj_03 obj_01 obj_09)
   goals met: 1 of 3
6. (op_1 obj_03 obj_07 obj_06)
   deleted: (pred_4 obj_03 obj_07)
   added: (pred_4 obj_03 obj_06)
   goals met: 1 of 3
7. (op_2 obj_03 obj_01 obj_06 obj_09)
   deleted: (pred_3 obj_03 obj_01 obj_09)
   added: (pred_2 obj_01 obj_06) (pred_1 obj_03 obj_09)
   goals met: 2 of 3
8. (op_1 obj_03 obj_06 obj_02)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_02)
   goals met: 2 of 3
9. (op_3 obj_03 obj_08 obj_02 obj_09)
   deleted: (pred_2 obj_08 obj_02) (pred_1 obj_03 obj_09)
   added: (pred_3 obj_03 obj_08 obj_09)
   goals met: 2 of 3
10. (op_1 obj_03 obj_02 obj_07)
   deleted: (pred_4 obj_03 obj_02)
   added: (pred_4 obj_03 obj_07)
   goals met: 2 of 3
11. (op_2 obj_03 obj_08 obj_07 obj_09)
   deleted: (pred_3 obj_03 obj_08 obj_09)
   added: (pred_2 obj_08 obj_07) (pred_1 obj_03 obj_09)
   goals met: 3 of 3
